CHT/heated_plate/FFTB/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     buoyantFoam;

solver          fluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

// purgeWrite      0;

writeFormat     ascii;

writePrecision  18;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

functions
{
    #includeFunc writeObjects(h, rho)
}
